#!/bin/bash
# ----------------------------------------------------------------------
# ~/.dotfiles/scripts/Brewfile
# Mark Spain
# ----------------------------------------------------------------------

# tap the repos
tap 'caskroom/homebrew-cask'
tap 'caskroom/fonts'

# install brew packages
brew 'autoconf'
brew 'automake'
brew 'bash-completion2'
brew 'cowsay'
brew 'faac'
brew 'faad2'
brew 'ffmpeg'
brew 'fortune'
brew 'gdbm'
brew 'gmp'
brew 'gnutls'
brew 'json-c'
brew 'lame'
brew 'libao'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libksba'
brew 'libtasn1'
brew 'libtool'
brew 'libyaml'
brew 'mad'
brew 'makedepend'
brew 'nettle'
brew 'node'
brew 'openssl'
brew 'p7zip'
brew 'pianobar'
brew 'pkg-config'
brew 'python'
brew 'readline'
brew 'sqlite'
brew 'texi2html'
brew 'vim'
brew 'wget'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'yasm'

# install cask
brew 'brew-cask'

# install fonts
cask 'font-source-code-pro'

# install casks
cask 'air-connect'
cask 'airdisplay'
cask 'appcleaner'
cask 'arduino'
cask 'atom'
cask 'bartender'
cask 'caffeine'
cask 'coda'
cask 'codebox'
cask 'codekit'
cask 'curse-client'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'google-drive'
cask 'grandperspective'
cask 'imageoptim'
#cask 'iterm2'
cask 'league-of-legends'
cask 'macgdbp'
cask 'macpaw-gemini'
cask 'mamp'
cask 'music-manager'
cask 'mysqlworkbench'
cask 'onyx'
cask 'pandora-one'
cask 'parallels'
cask 'remote-desktop-connection'
cask 'Remote Desktop'
cask 'sequel-pro'
cask 'sizeup'
cask 'sketch'
cask 'skype'
cask 'steam'
cask 'sublime-text'
cask 'teamviewer'
cask 'transmit'
cask 'tuneup'
cask 'unrarx'
cask 'vlc'
cask 'eclipse-ide'
cask 'istat-menus'
cask 'xscope'
